import React from 'react';
import {Link} from "react-router-dom";

const FulfilledRemind = () => {
    return (
        <section className="login">
            <form action="" className="login__form" style={{textAlign:"center"}}>
                <svg width="75" height="75" viewBox="0 0 75 75" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fillRule="evenodd" clipRule="evenodd" d="M37.5 6.25C20.2411 6.25 6.25 20.2411 6.25 37.5C6.25 54.7589 20.2411 68.75 37.5 68.75C54.7589 68.75 68.75 54.7589 68.75 37.5C68.75 34.4828 68.3233 31.5706 67.529 28.8178C67.0505 27.1596 68.0068 25.4274 69.665 24.9489C71.3233 24.4704 73.0554 25.4268 73.5339 27.085C74.4892 30.3953 75 33.8907 75 37.5C75 58.2107 58.2107 75 37.5 75C16.7893 75 0 58.2107 0 37.5C0 16.7893 16.7893 0 37.5 0C45.8017 0 53.4816 2.70129 59.6965 7.27195C61.0869 8.29448 61.3851 10.2505 60.3626 11.6409C59.34 13.0313 57.384 13.3295 55.9936 12.3069C50.8156 8.49882 44.425 6.25 37.5 6.25Z" fill="#14B855"/>
                    <path fillRule="evenodd" clipRule="evenodd" d="M20.9596 32.0085C22.18 30.7881 24.1586 30.7881 25.379 32.0085L38.6373 45.2668C39.8577 46.4872 39.8577 48.4658 38.6373 49.6862C37.4169 50.9066 35.4382 50.9066 34.2179 49.6862L20.9596 36.428C19.7392 35.2076 19.7392 33.2289 20.9596 32.0085Z" fill="#14B855"/>
                    <path fillRule="evenodd" clipRule="evenodd" d="M67.3637 20.9601L38.6375 49.6863C37.4171 50.9067 35.4385 50.9067 34.2181 49.6863C32.9977 48.4659 32.9977 46.4872 34.2181 45.2669L62.9443 16.5406C64.1647 15.3203 66.1433 15.3203 67.3637 16.5406C68.5841 17.761 68.5841 19.7397 67.3637 20.9601Z" fill="#14B855"/>
                </svg>
                <p className={"fulrem__desc"}>
                    Инструкция по востановлению пароля отправлена на вашу почту
                </p>
                <a className="fulrem__link" target={"_blank"}  href="https://www.google.com/intl/ru/gmail/about/">
                    Проверить почту
                </a>
            </form>
        </section>
    );
};

export default FulfilledRemind;